no_auth_error = """🚫 <b>Ошибка</b>: сначала необходимо войти в аккаунт!
Используйте /login для входа в аккаунт или /register для регистрации."""

already_in_account_error = "🚫 <b>Ошибка:</b> вы уже вошли в аккаунт!"

already_without_account_error = "🚫 <b>Ошибка:</b> вы уже вышли из аккаунта!"

enter_login_message = "🔒️ Введите логин аккаунта:"

create_login_message = "🔒️ Придумайте логин аккаунта: "

enter_password_message = "🔑 Введите пароль аккаунта:"

create_password_message = "🔑 Придумайте пароль для аккаунта:"

successful_account_logout = "✅ Вы успешно вышли из аккаунта!"

successful_account_register = "✅ Вы успешно создали и вошли в аккаунт!"

user_already_exists = "🚫 <b>Ошибка:</b> пользователь с таким login уже существует. Используйте /register для повтороной попытки."

successful_login = "✅ Вы успешно вошли в аккаунт!"

invalid_credentials = "🚫 <b>Ошибка:</b> логин или пароль введен неверно. Введите /login для повтороной попытки."