enter_name_of_new_folder = "🪧 <b>Введите название новой папки:</b>"

enter_new_name_of_folder = "🪧 <b>Введите новое название папки:</b>"

choose_folder_message = "📂 Выберите папку:"

choose_new_folder_message = "📂 Выберите новую папку:"

choose_folder_to_delete_message = "📂 Выберите папку для удаления:"

choose_folder_to_update_message = "📂 Выберите папку для обновления:"

choose_folder_for_import = "📂 Выберите папку для импортированных задач:"

success_folder_delete = '''✅ Папка "{name}" успешно удалена!
Используйте /tasks для просмотра всех папок.'''

succes_folder_create = '''✅ Папка "{name}" успешно создана!
Используйте /tasks для просмотра всех папок.'''

succes_folder_update_message = '''✅ Папка "{name}" успешно обновлена!
Используйте /tasks для просмотра всех папок.'''

show_progress_message = "📈 Отображать % выполненных задач в папке?"

folder_name_without_progress = '📁 <b>Папка "{name}"</b>:'

folder_name_with_progress = '📁 <b>Папка "{name}" (прогресс: {progress}%)</b>:'