get_tasks_message = "📁 <b>Все папки (и задачи без папки):</b>"

enter_task_name = "🪧 Введите название задачи:"

enter_tasks_for_import = "🪧 Введите задачи для импорта (каждая с новой строки):"

enter_new_task_name = "🪧 Введите новое название задачи:"

enter_task_text = "📝 Введите описание задачи:"

enter_new_task_text = "📝 Введите новое описание задачи:"

successful_delete_task_message = "✅ Задача успешно удалена!"

successful_mark_a_task_as_completed_message = '''✅ Задача "{task_name}" помечена как выполненная!
Используйте /tasks для просмотра всех задач.'''

successful_undone_task_message = '''✅ Задача "{name}" помечена как невыполненная!
Используйте /tasks для просмотра всех задач.'''

selected_task_message = '''📃 Задача "<b>{task_name}</b>"

{task_text}

<b>Статус</b>: {task_state}
<b>Дата создания</b>: {task_date}'''

successful_task_update_message = '''✅ Задача "{name}" успешно обновлена!

<b>Описание:</b> {text}
<b>Статус:</b> {state}

Используйте /tasks для просмотра всех задач.'''

success_task_create = '''✅ Задача "{name}" успешно создана!

<b>Описание:</b> {text}
<b>Папка:</b> {folder}

Используйте /tasks для просмотра всех задач.'''